app/controllers/accounts_controller.rb

  def show
    account = Account.find_by(user_id: current_user.id)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]