app/controllers/songs_controller.rb

  def index
    songs = Song.all
---
SELECT "songs".* FROM "songs"

  def show
    song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]